openfoam_runs/run_0002/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (3.0 0 0);   // patched by optimizer

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform (3.0 0 0);
    }
    outlet
    {
        type        inletOutlet;
        inletValue  uniform (3.0 0 0);
        value       uniform (3.0 0 0);
    }
    hull
    {
        type        noSlip;
    }
    front
    {
        type        slip;
    }
    back
    {
        type        slip;
    }
    bottom
    {
        type        slip;
    }
    top
    {
        type        symmetryPlane;
    }
}
